Bocha91/DS18B20_EFM32GG/EFM32GGxxx/CMSIS/Device/Include/EFM32GGxxx.h
/*****************************************************************************
 *                   SEGGER Microcontroller GmbH & Co. KG                    *
 *            Solutions for real time microcontroller applications           *
 *****************************************************************************
 *                                                                           *
 *               (c) 2017 SEGGER Microcontroller GmbH & Co. KG               *
 *                                                                           *
 *           Internet: www.segger.com   Support: support@segger.com          *
 *                                                                           *
 *****************************************************************************/

#ifndef __EFM32GGxxx_h
#define __EFM32GGxxx_h

#if defined(EFM32GG995F1024) || defined(EFM32GG995F512) || defined(EFM32GG990F1024) || defined(EFM32GG990F512) || defined(EFM32GG980F1024) || defined(EFM32GG980F512) || defined(EFM32GG942F1024) || defined(EFM32GG942F512) || defined(EFM32GG940F1024) || defined(EFM32GG940F512) || defined(EFM32GG900F1024) || defined(EFM32GG900F512) || defined(EFM32GG895F512) || defined(EFM32GG895F1024) || defined(EFM32GG890F1024) || defined(EFM32GG890F512) || defined(EFM32GG880F1024) || defined(EFM32GG880F512) || defined(EFM32GG842F1024) || defined(EFM32GG842F512) || defined(EFM32GG840F1024) || defined(EFM32GG840F512) || defined(EFM32GG395F1024) || defined(EFM32GG395F512) || defined(EFM32GG390F1024) || defined(EFM32GG390F512) || defined(EFM32GG380F1024) || defined(EFM32GG380F512) || defined(EFM32GG332F1024) || defined(EFM32GG332F512) || defined(EFM32GG330F1024) || defined(EFM32GG330F512) || defined(EFM32GG295F1024) || defined(EFM32GG295F512) || defined(EFM32GG290F1024) || defined(EFM32GG290F512) || defined(EFM32GG280F1024) || defined(EFM32GG280F512) || defined(EFM32GG232F1024) || defined(EFM32GG232F512) || defined(EFM32GG230F1024) || defined(EFM32GG230F512)

#include "em_device.h"

#endif

#endif
